package com.topnetwork.wallet.common.enums;

public enum LanguageEnum {
    /**
     * 中文(简体)
     */
    CN,
    /**
     * 英文
     */
    EN,
    /**
     * 韩文
     */
    KR,
    /**
     * 日文
     */
    JP,
    /**
     * 越南语
     */
    VN,
    /**
     * 香港地区(繁体中文)
     */
    HK,
    /**
     * 芬兰语(芬兰)
     */
    FI,
    /**
     * 丹麦语(丹麦)
     */
    DK,
    /**
     * 希伯来语(以色列)
     */
    IL,
    /**
     * 荷兰语(荷兰)
     */
    NL,
    /**
     * 葡萄牙语(葡萄牙)
     */
    PT,
    /**
     * 法语(法国)
     */
    FR,
    /**
     * 西班牙语(西班牙)
     */
    ES,
    /**
     * 德语(德国)
     */
    DE,
    /**
     * 俄语(俄罗斯)
     */
    RU,
    /**
     * 意大利语(意大利)
     */
    IT,
    /**
     * 希腊语(希腊)
     */
    GR,
    /**
     * 挪威语(挪威)
     */
    NO,
    /**
     * 匈牙利语(匈牙利)
     */
    HU,
    /**
     * 土耳其语(土耳其)
     */
    TR,
    /**
     * 捷克语(捷克共和国)
     */
    CZ,
    /**
     * 波兰语(波兰)
     */
    PL,
    /**
     * 瑞典语(瑞典)
     */
    SE,

}
